backend/app/controllers/computers_controller.rb

    def index
        computers = Computer.all.order('name ASC')
---
SELECT "computers".* FROM "computers" ORDER BY name ASC

    def show
        computer = Computer.find(params[:id])
---
SELECT "computers".* FROM "computers" WHERE "computers"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

    def create
        computer = Computer.create(computer_params)
---
INSERT INTO "computers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test1"], ["created_at", "2021-05-11 00:05:56.712090"], ["updated_at", "2021-05-11 00:05:56.712090"]]