backend/app/controllers/parts_controller.rb

    def index
        parts = Part.all
---
SELECT "parts".* FROM "parts"

    def show
        part = Part.find(params[:id])
---
SELECT "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        part = Part.create(part_params)
---
INSERT INTO "parts" ("item", "brand", "model", "price", "computer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item", "test1"], ["brand", "test2"], ["model", "test3"], ["price", 100], ["computer_id", 12], ["created_at", "2021-05-15 16:43:42.469719"], ["updated_at", "2021-05-15 16:43:42.469719"]]

    def update
        part = Part.find_by(id: params[:id])
        if part
             part.update(part_params)
---
SELECT "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "parts" SET "model" = ?, "price" = ?, "updated_at" = ? WHERE "parts"."id" = ?  [["model", "cr500"], ["price", 200], ["updated_at", "2021-05-25 23:09:44.362205"], ["id", 42]]

    def destroy
        part = Part.find_by(id: params[:id])
        part.destroy
---
SELECT "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]
DELETE FROM "parts" WHERE "parts"."id" = ?  [["id", 38]]